app/controllers/api/pictures_controller.rb

    def show
        # debugger
        @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]