app/controllers/api/users_controller.rb

    def create
      # debugger;
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "username", "firstname", "lastname", "password_digest", "session_token", "aboutMe", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"